"Discussion Thread | October 2024: Please refer to r/Coronavirus's [Wiki](https://www.reddit.com/r/Coronavirus/wiki/index) for more information on COVID-19 and our sub. You can find answers to frequently asked questions in our [FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq).  &#x200B;  [The World Health Organization COVID-19 information](https://www.who.int/emergencies/diseases/novel-coronavirus-2019)  [CDC data tracker of COVID-19 vaccinations in the United States](https://covid.cdc.gov/covid-data-tracker/#vaccinations)  [Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_vaccines)  [Vaccine appointment resource](https://www.reddit.com/r/Coronavirus/wiki/faq/vaccinefinder)     [Join the user moderated Discord server](https://discord.gg/R5RuY834dv) (we do not manage this and are not responsible for it)  Join r/COVID19 for scientific, reliably-sourced discussion. Rules are enforced more strictly there than here in r/Coronavirus.     **All previous discussion threads are available here:**  [Monthly and previously Weekly Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Discussion%20Thread%22)  [Daily Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Daily%20Discussion%22) Discussion Thread | September 2024: Please refer to r/Coronavirus's [Wiki](https://www.reddit.com/r/Coronavirus/wiki/index) for more information on COVID-19 and our sub. You can find answers to frequently asked questions in our [FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq).  &#x200B;  [The World Health Organization COVID-19 information](https://www.who.int/emergencies/diseases/novel-coronavirus-2019)  [CDC data tracker of COVID-19 vaccinations in the United States](https://covid.cdc.gov/covid-data-tracker/#vaccinations)  [Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_vaccines)  [Vaccine appointment resource](https://www.reddit.com/r/Coronavirus/wiki/faq/vaccinefinder)     [Join the user moderated Discord server](https://discord.gg/R5RuY834dv) (we do not manage this and are not responsible for it)  Join r/COVID19 for scientific, reliably-sourced discussion. Rules are enforced more strictly there than here in r/Coronavirus.     **All previous discussion threads are available here:**  [Monthly and previously Weekly Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Discussion%20Thread%22)  [Daily Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Daily%20Discussion%22) Discussion Thread | August 2024: Please refer to r/Coronavirus's [Wiki](https://www.reddit.com/r/Coronavirus/wiki/index) for more information on COVID-19 and our sub. You can find answers to frequently asked questions in our [FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq).  &#x200B;  [The World Health Organization COVID-19 information](https://www.who.int/emergencies/diseases/novel-coronavirus-2019)  [CDC data tracker of COVID-19 vaccinations in the United States](https://covid.cdc.gov/covid-data-tracker/#vaccinations)  [Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_vaccines)  [Vaccine appointment resource](https://www.reddit.com/r/Coronavirus/wiki/faq/vaccinefinder)     [Join the user moderated Discord server](https://discord.gg/R5RuY834dv) (we do not manage this and are not responsible for it)  Join r/COVID19 for scientific, reliably-sourced discussion. Rules are enforced more strictly there than here in r/Coronavirus.     **All previous discussion threads are available here:**  [Monthly and previously Weekly Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Discussion%20Thread%22)  [Daily Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Daily%20Discussion%22) Discussion Thread | July 2024: Please refer to r/Coronavirus's [Wiki](https://www.reddit.com/r/Coronavirus/wiki/index) for more information on COVID-19 and our sub. You can find answers to frequently asked questions in our [FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq).  &#x200B;  [The World Health Organization COVID-19 information](https://www.who.int/emergencies/diseases/novel-coronavirus-2019)  [CDC data tracker of COVID-19 vaccinations in the United States](https://covid.cdc.gov/covid-data-tracker/#vaccinations)  [Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_vaccines)  [Vaccine appointment resource](https://www.reddit.com/r/Coronavirus/wiki/faq/vaccinefinder)     [Join the user moderated Discord server](https://discord.gg/R5RuY834dv) (we do not manage this and are not responsible for it)  Join r/COVID19 for scientific, reliably-sourced discussion. Rules are enforced more strictly there than here in r/Coronavirus.     **All previous discussion threads are available here:**  [Monthly and previously Weekly Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Discussion%20Thread%22)  [Daily Discussion Threads](https://www.reddit.com/r/Coronavirus/?f=flair_name%3A%22Daily%20Discussion%22) From its first emergence in Wuhan, China in December, 2019 the COVID-19pandemic has caused unprecedented health crisis throughout the world. The novelcoronavirus disease is caused by severe acute respiratory syndrome coronavirus2 (SARS-CoV-2) which belongs to the coronaviridae family. In this paper, acomparative genomic analysis of eight coronaviruses namely Human coronavirusOC43 (HCoV-OC43), Human coronavirus HKU1 (HCoV-HKU1), Human coronavirus 229E(HCoV-229E), Human coronavirus NL63 (HCoV-NL63), Severe acute respiratorysyndrome coronavirus (SARS-CoV), Middle East respiratory syndrome-relatedcoronavirus (MERS-CoV), Severe acute respiratory syndrome coronavirus 2(SARS-CoV-2) and Bat coronavirus RaTG13 has been carried out using Chaos GameRepresentation and Fisher-Shannon Complexity (CGR-FSC) measure. Chaos GameRepresentation (CGR) is a unique alignment-free method to visualize onedimensional DNA sequence in a two-dimensional fractal-like pattern. Thetwo-dimensional CGR pattern is then quantified by Fisher-Shannon Complexity(FSC) measure. The CGR-FSC can effectively identify the viruses uniquely andtheir similarity/dissimilarity can be revealed in the Fisher-ShannonInformation Plane (FSIP). The outbreak of coronavirus disease 2019 (COVID-19) has had a significantrepercussion on the health, economy, politics and environment, makingcoronavirus-related issues more complicated and difficult to solve adequatelyby relying on a single field. Interdisciplinary research can provide aneffective solution to complex issues in the related field of coronavirus.However, whether coronavirus related research becomes more interdisciplinarystill needs corroboration. In this study, we investigate interdisciplinarystatus of the coronavirus-related fields via the COVID-19 Open Research Dataset(CORD-19). To this end, we calculate bibliometric indicators ofinterdisciplinarity and a co-occurrence analysis method. The results show thatco-occurrence relationships between cited disciplines have evolved dynamicallyover time. The two types of co-occurrence relationships, Immunology andMicrobiology & Medicine and Chemical Engineering & Chemistry, last for a longtime in this field during 1990-2020. Moreover, the number of disciplines citedby coronavirus-related research increases, whereas the distribution ofdisciplines is uneven, and this field tends to focus on several dominantdisciplines such as Medicine, Immunology and Microbiology, Biochemistry,Genetics and Molecular Biology. We also gauge the disciplinary diversity ofCOVID-19 related papers published from January to December 2020; thedisciplinary variety shows an upward trend, while the degree of disciplinarybalance shows a downward trend. Meanwhile, the comprehensive index 2Dsdemonstrates that the degree of interdisciplinarity in coronavirus fielddecreases between 1990 and 2019, but it increases in 2020. The results help tomap the interdisciplinarity of coronavirus-related research, gaining insightinto the degree and history of interdisciplinary cooperation. This study examined the impact of social media in the fight against thespread of coronavirus (COVID-19) pandemic in Anambra state, Nigeria. The keyobjectives are to: find out if the numbers of social media users increased inAnambra state since the wake of coronavirus pandemic; find out if the socialmedia is being utilised in the fight against the spread of coronavirus pandemicin Anambra state; find out how the social media is being utilised in the fightagainst the spread of coronavirus pandemic in Anambra state; and discover theimpact of social media in the fight against the spread of coronavirus pandemicin Anambra State. It was anchored on Agenda Setting Theory, and theTechnological Determinism Theory (TDT). The study was designed as a survey withclose-ended questionnaire distributed to 400 respondents. The findings of thisstudy revealed that usage and accessibility of social media increased inAnambra state because of coronavirus pandemic. It also revealed that the socialmedia is being utilised by individuals, NGOs and government in the fightagainst the spread of coronavirus in Anambra state. The study also found thatthe social media is being utilised to gather and disseminate information,study, transact businesses, among other things. The finding also showed thatthe social media has positive impact in the fight against the spread ofcoronavirus in Anambra state. The study concluded that social media has muchbenefits than negative impact, and should be used to contain the spread ofcoronavirus. It, among other things, recommended training and empowerment ofthe citizens on effective utilisation of social media to create impact in thesociety. The paper explores and analyses the trend of world literature on \"CoronavirusDisease\" in terms of the output of research publications as indexed in theScience Citation Index Expanded (SCI-E) of Web of Science during the periodfrom 2011 to 2020. The study found that 6071 research records have beenpublished on Coronavirus Disease till March 20, 2020. The various scientometriccomponents of the research records published in the study period were studied.The study reveals the various aspects of Coronavirus Disease literature such asyear wise distribution, relative growth rate, doubling time of literature,geographical wise, organization wise, language wise, form wise , most prolificauthors, and source wise. The highest number of articles was published in theyear 2019, while lowest numbers of research article were reported in the year2020. Further, the relative growth rate is gradually increases and on the otherhand doubling time decreases. Most of the research publications are publishedin English language and most of the publications published in the form ofresearch articles. USA is the highest contributor to the field of CoronavirusDisease literature. Human genes required for SARS-CoV-2 entry into human cells, ACE2 and FURIN,were employed as baits to build genomics-guided maps of up-stream regulatoryelements, their expression and functions in human body, includingpathophysiologically-relevant cell types. Genes acting as repressors andactivators of the ACE2 and FURIN genes were identified based on the analyses ofgene silencing and overexpression experiments as well as relevant transgenicmouse models. Panels of repressors (VDR; GATA5; SFTPC; HIF1a) and activators(HMGA2; INSIG1) were then employed to identify existing drugs that could berepurposed to mitigate the coronavirus infection. Present analyses identifyVitamin D and Quercetin as promising pandemic mitigation agents. Geneexpression profiles of Vitamin D and Quercetin activities and their establishedsafety records as over-the-counter medicinal substances suggest that they mayrepresent viable candidates for further assessment and considerations of theirpotential as coronavirus pandemic mitigation agents. Notably, gene setenrichment analyses and expression profiling experiments identify multipledrugs, most notably testosterone, dexamethasone, and doxorubicin, smoking, andmany disease conditions that appear to act as putative coronavirusinfection-promoting agents. Discordant patterns of Testosterone versusEstradiol impacts on SCARS-CoV-2 targets suggest a plausible molecularexplanation of the apparently higher male mortality during coronaviruspandemic. The paper studies different regression approaches for modeling COVID-19spread and its impact on the stock market. The logistic curve model was usedwith Bayesian regression for predictive analytics of the coronavirus spread.The impact of COVID-19 was studied using regression approach and compared toother crises influence. In practical analytics, it is important to find themaximum of coronavirus cases per day, this point means the estimated half timeof coronavirus spread in the region under investigation. The obtained resultsshow that different crises with different reasons have different impact on thesame stocks. It is important to analyze their impact separately. Bayesianinference makes it possible to analyze the uncertainty of crisis impacts. We study observed incidence of self-disclosure in a large dataset of Tweetsrepresenting user-led English-language conversation about the Coronaviruspandemic. Using an unsupervised approach to detect voluntary disclosure ofpersonal information, we provide early evidence that situational factorssurrounding the Coronavirus pandemic may impact individuals' privacy calculus.Text analyses reveal topical shift toward supportiveness and support-seeking inself-disclosing conversation on Twitter. We run a comparable analysis of Tweetsfrom Hurricane Harvey to provide context for observed effects and suggestopportunities for further study. A major difficulty in the analysis of propagation of the coronavirus is thatmany infected individuals show no symptoms of Covid-19. This implies a lack ofinformation on the total counts of infected individuals and of recovered andimmunized individuals. In this paper, we consider parametric time varyingMarkov processes of Coronavirus propagation and show how to estimate the modelparameters and approximate the unobserved counts from daily numbers of infectedand detected individuals and total daily death counts. This model-basedapproach is illustrated in an application to French data. The coronavirus disease 2019 bursted out about two months ago in Wuhan hascaused the death of more than a thousand people. China is fighting hard againstthe epidemics with the helps from all over the world. On the other hand, thereappear to be doubts on the reported case number. In this article, we propose atest of the reported case number of coronavirus disease 2019 in China withNewcomb-Benford law. We find a $p$-value of $92.8\\%$ in favour that thecumulative case numbers abide by the Newcomb-Benford law. Even though thereported case number can be lower than the real number of affected people dueto various reasons, this test does not seem to indicate the detection offrauds. The novel Coronavirus (COVID-19) is an infectious disease caused by a newvirus called COVID-19 or 2019-nCoV that first identified in Wuhan, China. Thedisease causes respiratory illness (such as the flu) with other symptoms suchas a cough, fever, and in more severe cases, difficulty breathing. This newCoronavirus seems to be very infectious and has spread quickly and globally. Inthis work, information about COVID-19 is provided and the situation in Arabcountries and territories regarding the COVID-19 strike is presented. The nextfew weeks main expectations is also given. In this paper, we have applied the logistic growth regression model andgenetic algorithm to predict the number of coronavirus infected cases that canbe expected in upcoming days in India and also estimated the final size and itspeak time of the coronavirus epidemic in India. The community spread of coronavirus at great Chicago area has severelythreatened the residents health, family and normal activities. CDC dailyupdates on infected cases on County level are not satisfying to address publicsconcern on virus spread. On March 20th, NBC5 published case information of 435coronavirus infections. The data is relative comprehensive and of high valuefor understanding on the virus spread patterns at Chicago. Data engineering,natural language processing and Google map technology are applied to organizethe data and retrieve geographic information of the virus. The analysis showscommunity spread in Chicago areas has a potential proximity relation withpublic commuter rail. Residents nearby major public commuter rails need limitoutdoor activities during the outbreak and even the post-peak time. The beginning of 2020 has seen the emergence of coronavirus outbreak causedby a novel virus called SARS-CoV-2. The sudden explosion and uncontrolledworldwide spread of COVID-19 show the limitations of existing healthcaresystems in timely handling public health emergencies. In such contexts,innovative technologies such as blockchain and Artificial Intelligence (AI)have emerged as promising solutions for fighting coronavirus epidemic. Inparticular, blockchain can combat pandemics by enabling early detection ofoutbreaks, ensuring the ordering of medical data, and ensuring reliable medicalsupply chain during the outbreak tracing. Moreover, AI provides intelligentsolutions for identifying symptoms caused by coronavirus for treatments andsupporting drug manufacturing. Therefore, we present an extensive survey on theuse of blockchain and AI for combating COVID-19 epidemics. First, we introducea new conceptual architecture which integrates blockchain and AI for fightingCOVID-19. Then, we survey the latest research efforts on the use of blockchainand AI for fighting COVID-19 in various applications. The newly emergingprojects and use cases enabled by these technologies to deal with coronaviruspandemic are also presented. A case study is also provided using federated AIfor COVID-19 detection. Finally, we point out challenges and future directionsthat motivate more research efforts to deal with future coronavirus-likeepidemics. A novel bioinspired metaheuristic is proposed in this work, simulating howthe coronavirus spreads and infects healthy people. From an initial individual(the patient zero), the coronavirus infects new patients at known rates,creating new populations of infected people. Every individual can either die orinfect and, afterwards, be sent to the recovered population. Relevant termssuch as re-infection probability, super-spreading rate or traveling rate areintroduced in the model in order to simulate as accurately as possible thecoronavirus activity. The Coronavirus Optimization Algorithm has two majoradvantages compared to other similar strategies. First, the input parametersare already set according to the disease statistics, preventing researchersfrom initializing them with arbitrary values. Second, the approach has theability of ending after several iterations, without setting this value either.Infected population initially grows at an exponential rate but after someiterations, when considering social isolation measures and the high numberrecovered and dead people, the number of infected people starts decreasing insubsequent iterations. Furthermore, a parallel multi-virus version is proposedin which several coronavirus strains evolve over time and explore wider searchspace areas in less iterations. Finally, the metaheuristic has been combinedwith deep learning models, in order to find optimal hyperparameters during thetraining phase. As application case, the problem of electricity load timeseries forecasting has been addressed, showing quite remarkable performance. The coronavirus disease (COVID-19) pandemic, caused by the coronavirusSARS-CoV-2, has caused 60 millions of infections and 1.38 millions offatalities. Genomic analysis of SARS-CoV-2 can provide insights on drug designand vaccine development for controlling the pandemic. Inverted repeats in agenome greatly impact the stability of the genome structure and regulate geneexpression. Inverted repeats involve cellular evolution and genetic diversity,genome arrangements, and diseases. Here, we investigate the inverted repeats inthe coronavirus SARS-CoV-2 genome. We found that SARS-CoV-2 genome has anabundance of inverted repeats. The inverted repeats are mainly located in thegene of the Spike protein. This result suggests the Spike protein geneundergoes recombination events, therefore, is essential for fast evolution.Comparison of the inverted repeat signatures in human and bat coronavirusessuggest that SARS-CoV-2 is mostly related SARS-related coronavirus,SARSr-CoV/RaTG13. The study also reveals that the recent SARS-relatedcoronavirus, SARSr-CoV/RmYN02, has a high amount of inverted repeats in thespike protein gene. Besides, this study demonstrates that the inverted repeatdistribution in a genome can be considered as the genomic signature. This studyhighlights the significance of inverted repeats in the evolution of SARS-CoV-2and presents the inverted repeats as the genomic signature in genome analysis. The COVID-19 pandemic led to 1.1 million deaths in the United States, despitethe explosion of coronavirus research. These new findings are slow to translateto clinical interventions, leading to poorer patient outcomes and unnecessarydeaths. One reason is that clinicians, overwhelmed by patients, struggle tokeep pace with the rate of new coronavirus literature. A potential solution isdeveloping a tool for evaluating coronavirus literature using large languagemodels (LLMs) -- neural networks that are deployed for natural languageprocessing. LLMs can be used to summarize and extract user-specifiedinformation. The greater availability and advancement of LLMs and pre-processedcoronavirus literature databases provide the opportunity to assist cliniciansin evaluating coronavirus literature through a coronavirus literature specificLLM (covLLM), a tool that directly takes an inputted research article and auser query to return an answer. Using the COVID-19 Open Research Dataset(CORD-19), we produced two datasets: (1) synCovid, which uses a combination ofhandwritten prompts and synthetic prompts generated using OpenAI, and (2) realabstracts, which contains abstract and title pairs. covLLM was trained withLLaMA 7B as a baseline model to produce three models trained on (1) the Alpacaand synCovid datasets, (2) the synCovid dataset, and (3) the synCovid and realabstract datasets. These models were evaluated by two human evaluators andChatGPT. Results demonstrate that training covLLM on the synCovid and abstractpairs datasets performs competitively with ChatGPT and outperforms covLLMtrained primarily using the Alpaca dataset. Here after performing docking and molecular dynamics of various smallmolecules derived as a secondary metabolite from fungi, we propose Flaviolin toact as potent inhibitor of 3-chymotrypsin (3C) like protease (3CLpro) of novalcorona virus SARS-CoV2 responsible for pandemic condition caused by coronavirusdisease 2019 (COVID-19). Coronaviruses have recently caused world-wide severe outbreaks: SARS (SevereAcute Respiratory Syndrome) in 2002 and MERS (Middle-East Respiratory Syndrome)in 2012. At the end of 2019, a new coronavirus outbreak appeared in Wuhan(China) seafood market as first focus of infection, becoming a pandemics in2020, spreading mainly into Europe and Asia. Although the virus family iswell-known, this specific virus presents considerable differences, as highertransmission rates, being a challenge for diagnostic methods, treatments andvaccines. Coronavirus(C++).pro is a C++ application which simulates Coronavirusreplication cycle. This software has identified virus type in short times andprovided FASTA files of virus proteins, a list of mRNA sequences and secondarystructures. Furthermore, the software has identified a list of structural,non-structural and accessory proteins in 2019-nCoV virus genome more similar toSARS than to MERS, as several fusion proteins characteristics of this virustype. These results are useful as a first step in order to develop diagnosticmethods, new vaccines or antiviral drugs, which could avoid virus replicationin any stage: fusion inhibitors, RdRp inhibitors and PL2pro/3CLpro proteaseinhibitors. 2019-nCoV is a novel coronavirus was isolated and identified in 2019 inWuhan, China. On 17th February and according to world health organization, anumber of 71 429 confirmed cases worldwide, among them 2162 new cases recordedin the last 24 hours. There is no drug or vaccine for human and animalcoronavirus. The inhibition of 3CL hydrolase enzyme provides a promisingtherapeutic principle for developing treatments against CoViD-19. The 3CLpro(Mpro) known for involving in counteracting the host innate immune response.This work presents the inhibitory effect of some natural compounds against 3CLhydrolase enzyme, and explain the main interactions in inhibitor-enzymecomplex. Molecular docking study carried out using Autodock Vina. By screeningseveral molecules, we identified three candidate agents that inhibit the mainprotease of coronavirus. Hispidin, lepidine E, and folic acid bound tightly inthe enzyme, strong hydrogen bonds have been formed (1.69-1.80&[Aring]) with theactive site residues. This study provides a possible therapeutic strategy forCoViD-19. It is shown that the evaporation rate of a liquid sample containing theculture of coronavirus affects its survival on a substrate. Possible mechanismsof such influence can be due to the appearance of large, about 140 bar, noncomprehensive capillary pressures and the associated dynamic forces during themovement of the evaporation front in a sample with the virus. A simulation ofisothermal evaporation of a thin liquid sample based on the Stefan problem wasperformed. The comparison of simulation data and recent experiments on thecoronavirus survival on various surfaces showed that the rate of isothermalevaporation of aqueous samples, which is higher for heat-conducting materials,correlates well with the lifetime of the coronavirus on these surfaces. The 2020 coronavirus pandemic was a historic social disruption withsignificant consequences felt around the globe. Wikipedia is afreely-available, peer-produced encyclopedia with a remarkable ability tocreate and revise content following current events. Using 973,940 revisionsfrom 134,337 editors to 4,238 articles, this study examines the dynamics of theEnglish Wikipedia's response to the coronavirus pandemic through the first fivemonths of 2020 as a \"quantitative portrait\" describing the emergentcollaborative behavior at three levels of analysis: article revision, editorcontributions, and network dynamics. Across multiple data sources, quantitativemethods, and levels of analysis, we find four consistent themes characterizingWikipedia's unique large-scale, high-tempo, and temporary onlinecollaborations: external events as drivers of activity, spillovers of activity,complex patterns of editor engagement, and the shadows of the future. In lightof increasing concerns about online social platforms' abilities to govern theconduct and content of their users, we identify implications from Wikipedia'scoronavirus collaborations for improving the resilience of socio-technicalsystems during a crisis. In the age of social media, disasters and epidemics usher not only adevastation and affliction in the physical world, but also prompt a deluge ofinformation, opinions, prognoses and advice to billions of internet users. Thecoronavirus epidemic of 2019-2020, or COVID-19, is no exception, with the WorldHealth Organization warning of a possible \"infodemic\" of fake news. In thisstudy, we examine the alternative narratives around the coronavirus outbreakthrough advertisements promoted on Facebook, the largest social media platformin the US. Using the new Facebook Ads Library, we discover advertisers frompublic health and non-profit sectors, alongside those from news media,politics, and business, incorporating coronavirus into their messaging andagenda. We find the virus used in political attacks, donation solicitations,business promotion, stock market advice, and animal rights campaigning. Amongthese, we find several instances of possible misinformation, ranging frombioweapons conspiracy theories to unverifiable claims by politicians. As wemake the dataset available to the community, we hope the advertising domainwill become an important part of quality control for public healthcommunication and public discourse in general. We provide one of the first systematic assessments of the development anddeterminants of economic anxiety at the onset of the coronavirus pandemic.Using a global dataset on internet searches and two representative surveys fromthe US, we document a substantial increase in economic anxiety during and afterthe arrival of the coronavirus. We also document a large dispersion in beliefsabout the pandemic risk factors of the coronavirus, and demonstrate that thesebeliefs causally affect individuals' economic anxieties. Finally, we show thatindividuals' mental models of infectious disease spread understate non-lineargrowth and shape the extent of economic anxiety. At the time of this writing, the novel coronavirus (COVID-19) pandemicoutbreak has already put tremendous strain on many countries' citizens,resources and economies around the world. Social distancing measures, travelbans, self-quarantines, and business closures are changing the very fabric ofsocieties worldwide. With people forced out of public spaces, much conversationabout these phenomena now occurs online, e.g., on social media platforms likeTwitter. In this paper, we describe a multilingual coronavirus (COVID-19)Twitter dataset that we have been continuously collecting since January 22,2020. We are making our dataset available to the research community(https://github.com/echen102/COVID-19-TweetIDs). It is our hope that ourcontribution will enable the study of online conversation dynamics in thecontext of a planetary-scale epidemic outbreak of unprecedented proportions andimplications. This dataset could also help track scientific coronavirusmisinformation and unverified rumors, or enable the understanding of fear andpanic -- and undoubtedly more. Ultimately, this dataset may contribute towardsenabling informed solutions and prescribing targeted policy interventions tofight this global crisis. The 2020 coronavirus pandemic has heightened the need to flagcoronavirus-related misinformation, and fact-checking groups have taken toverifying misinformation on the Internet. We explore stories reported byfact-checking groups PolitiFact, Poynter and Snopes from January to June 2020,characterising them into six story clusters before then analyse time-series andstory validity trends and the level of agreement across sites. We further breakdown the story clusters into more granular story types by proposing a uniqueautomated method with a BERT classifier, which can be used to classify diversestory sources, in both fact-checked stories and tweets. The present world is badly affected by novel coronavirus (COVID-19). Usingmedical kits to identify the coronavirus affected persons are very slow. Whathappens in the next, nobody knows. The world is facing erratic problem and donot know what will happen in near future. This paper is trying to makeprognosis of the coronavirus recovery cases using LSTM (Long Short TermMemory). This work exploited data of 258 regions, their latitude and longitudeand the number of death of 403 days ranging from 22-01-2020 to 27-02-2021.Specifically, advanced deep learning-based algorithms known as the LSTM, play agreat effect on extracting highly essential features for time series data (TSD)analysis.There are lots of methods which already use to analyze propagationprediction. The main task of this paper culminates in analyzing the spreadingof Coronavirus across worldwide recovery cases using LSTM deep learning-basedarchitectures. The recent coronavirus outbreak has made governments face an inconvenienttradeoff choice, i.e. the choice between saving lives and saving the economy,forcing them to make immensely consequential decisions among alternativecourses of actions without knowing what the ultimate results would be for thesociety as a whole. This paper attempts to frame the coronavirus tradeoffproblem as an economic optimization problem and proposes mathematicaloptimization methods to make rationally optimal decisions when faced withtrade-off situations such as those involved in managing through the recentcoronavirus pandemic. The framework introduced and the method proposed in thispaper are on the basis of the theory of rational choice at a societal level,which assumes that the government is a rational, benevolent agent thatsystematically and purposefully takes into account the social marginal costsand social marginal benefits of its actions to its citizens and makes decisionsthat maximize the society's well-being as a whole. We approach solving thistradeoff problem from a static as well as a dynamic point of view. Finally, weprovide several numerical examples clarifying how the proposed framework andmethods can be applied in the real-world context. Purpose: Develop AI-based automated CT image analysis tools for detection,quantification, and tracking of Coronavirus; demonstrate they can differentiatecoronavirus patients from non-patients. Materials and Methods: Multipleinternational datasets, including from Chinese disease-infected areas wereincluded. We present a system that utilizes robust 2D and 3D deep learningmodels, modifying and adapting existing AI models and combining them withclinical understanding. We conducted multiple retrospective experiments toanalyze the performance of the system in the detection of suspected COVID-19thoracic CT features and to evaluate evolution of the disease in each patientover time using a 3D volume review, generating a Corona score. The studyincludes a testing set of 157 international patients (China and U.S). Results:Classification results for Coronavirus vs Non-coronavirus cases per thoracic CTstudies were 0.996 AUC (95%CI: 0.989-1.00) ; on datasets of Chinese control andinfected patients. Possible working point: 98.2% sensitivity, 92.2%specificity. For time analysis of Coronavirus patients, the system outputenables quantitative measurements for smaller opacities (volume, diameter) andvisualization of the larger opacities in a slice-based heat map or a 3D volumedisplay. Our suggested Corona score measures the progression of disease overtime. Conclusion: This initial study, which is currently being expanded to alarger population, demonstrated that rapidly developed AI-based image analysiscan achieve high accuracy in detection of Coronavirus as well as quantificationand tracking of disease burden. COVID-19 pandemic has adversely and disproportionately impacted peoplesuffering from mental health issues and substance use problems. This has beenexacerbated by social isolation during the pandemic and the social stigmaassociated with mental health and substance use disorders, making peoplereluctant to share their struggles and seek help. Due to the anonymity andprivacy they provide, social media emerged as a convenient medium for people toshare their experiences about their day to day struggles. Reddit is awell-recognized social media platform that provides focused and structuredforums called subreddits, that users subscribe to and discuss their experienceswith others. Temporal assessment of the topical correlation between socialmedia postings about mental health/substance use and postings about Coronavirusis crucial to better understand public sentiment on the pandemic and itsevolving impact, especially related to vulnerable populations. In this study,we conduct a longitudinal topical analysis of postings between subredditsr/depression, r/Anxiety, r/SuicideWatch, and r/Coronavirus, and postingsbetween subreddits r/opiates, r/OpiatesRecovery, r/addiction, and r/Coronavirusfrom January 2020 - October 2020. Our results show a high topical correlationbetween postings in r/depression and r/Coronavirus in September 2020. Further,the topical correlation between postings on substance use disorders andCoronavirus fluctuates, showing the highest correlation in August 2020. Bymonitoring these trends from platforms such as Reddit, epidemiologists, andmental health professionals can gain insights into the challenges faced bycommunities for targeted interventions. The COVID-19 pandemic is spreading rapidly around the world, causingcountries to impose lockdowns and efforts to develop vaccines on a globalscale. However, human-to-animal and animal-to-human transmission cannot beignored, as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) canspread rapidly in farmed and wild animals. This could create a worrying cycleof SARS-CoV-2 spillover from humans to animals and spillback of new strainsback into humans, rendering vaccines ineffective. This study provides a keyindicator of animals that may be potential susceptible hosts for SARS-CoV-2 andcoronavirus infections by analysing the phylogenetic distance between hostangiotensin-converting enzyme 2 and the coronavirus spike protein. Crucially,our analysis identifies animals that are at elevated risk from a spillover andspillback incident. One group of animals has been identified as potentiallysusceptible to SARS-CoV-2 by harbouring a parasitic coronavirus spike proteinsimilar to the SARS-CoV-2 spike protein. These animals may serve asamplification hosts in spillover events from zoonotic reservoirs. Tracinginterspecies transmission in multi-host environments based solely on in vitroand in vivo examinations of animal susceptibility or serology is atime-consuming task. This approach allows rapid identification of high-riskanimals to prioritize research and assessment of the risk of zoonotic diseasetransmission in the environment. It is a tool to rapidly identify zoonoticspecies that may cause outbreaks or participate in expansion cycles ofcoexistence with their hosts. This prevents the spread of coronavirusinfections between species, preventing spillover and spillback incidents fromoccurring. The objective of the study is to examine coronavirus disease (COVID-19)related discussions, concerns, and sentiments that emerged from tweets postedby Twitter users. We analyze 4 million Twitter messages related to the COVID-19pandemic using a list of 25 hashtags such as \"coronavirus,\" \"COVID-19,\"\"quarantine\" from March 1 to April 21 in 2020. We use a machine learningapproach, Latent Dirichlet Allocation (LDA), to identify popular unigram,bigrams, salient topics and themes, and sentiments in the collected Tweets.Popular unigrams include \"virus,\" \"lockdown,\" and \"quarantine.\" Popular bigramsinclude \"COVID-19,\" \"stay home,\" \"corona virus,\" \"social distancing,\" and \"newcases.\" We identify 13 discussion topics and categorize them into fivedifferent themes, such as \"public health measures to slow the spread ofCOVID-19,\" \"social stigma associated with COVID-19,\" \"coronavirus news casesand deaths,\" \"COVID-19 in the United States,\" and \"coronavirus cases in therest of the world\". Across all identified topics, the dominant sentiments forthe spread of coronavirus are anticipation that measures that can be taken,followed by a mixed feeling of trust, anger, and fear for different topics. Thepublic reveals a significant feeling of fear when they discuss the coronavirusnew cases and deaths than other topics. The study shows that Twitter data andmachine learning approaches can be leveraged for infodemiology study bystudying the evolving public discussions and sentiments during the COVID-19.Real-time monitoring and assessment of the Twitter discussion and concerns canbe promising for public health emergency responses and planning. Alreadyemerged pandemic fear, stigma, and mental health concerns may continue toinfluence public trust when there occurs a second wave of COVID-19 or a newsurge of the imminent pandemic. Coronavirus or COVID-19, which has been declared pandemic by the World HealthOrganization, has incurred huge losses to the lives of people throughout theworld. Although, the scientists, researchers and doctors are working round theclock to develop a vaccine for COVID-19, it may take a year or two to make asafe and effective vaccine available for the world. In current circumstances, asolution must be developed to control or stop the spread of the virus. For thispurpose, a novel technique based on call data record analysis (CDRA)and contacttracing is proposed that can effectively control the coronavirus outbreak. Apositive coronavirus patient can be traced through CDRA and contact tracing.The technique can track the path traversed by the patient and collect the cellnumbers of all those people who have met with the patient. Keeping in tact theprivacy of this group of people, who are contacted through their cell numbersso that they can isolate themselves till the result of their coronavirus testarrives. If a test result of a person comes positive among the group, thenhe/she must be isolated and same CDRA and contact tracing procedures areadopted for that person. A COVID-19 patient is geo tagged and alerts are sentif any violation of isolation is done by the patient. Moreover, the generalpublic is informed in advance to avoid the path followed by the patients. Thiscost effective mechanism is not only capable to control the coronavirusoutbreak but also helps in isolating the patient in his/her house. A mathematical model is proposed for quantitative description of the outbreakof novel coronavirus COVID-19 in China. Although the model is relativelysimple, the comparison with the public data shows that an exact solutionsolution of the model (with the correctly-specified parameters) leads to theresults, which are in good agreement with the measured data. Prediction of thetotal number of the COVID-19 cases is discussed and an example is presentedusing the measured data in Austria. This paper deals with the mathematical modeling and numerical simulationsrelated to the coronavirus dynamics. A description is developed based on theframework of susceptible-exposed-infectious-recovered model. Initially, a modelverification is carried out calibrating system parameters with data from China,Italy, Iran and Brazil. Afterward, numerical simulations are performed toanalyzed different scenarios of COVID-19 in Brazil. Results show the importanceof governmental and individual actions to control the number and the period ofthe critical situations related to the pandemic. The goal of this work is to analyse the effects of control policies for thecoronavirus (COVID-19) epidemic in Brazil. This is done by considering anage-structured SEIR model with a quarantine class and two types of controls.The first one studies the sensitivity with regard to the parameters of thebasic reproductive number R0 which is calculated by the next generation method.The second one evaluates different quarantine strategies by comparing theirrelative total number of deaths. We discuss the pros of adopting government-issued digital currencies as wellas a supranational digital iCurrency. One such pro is to get rid of paper money(and coinage), a ubiquitous medium for spreading germs, as highlighted by therecent coronavirus outbreak. We set forth three policy recommendations foradapting mobile devices as new digital wallets, regulatory oversight ofsovereign digital currencies and user data protection, and a supranationaldigital iCurrency for facilitating international digital monetary linkages. We propose a mesoscale model structure for the coronavirus nucleocapsid,assembled from the high resolution structures of the basic building blocks ofthe N-protein, CryoEM imaging and mathematical constraints for an overallquasi-spherical particle. The structure is a truncated octahedron thataccommodates two layers: an outer shell composed of triangular and quadrangularlattices of the N-terminal domain and an inner shell of equivalent lattices ofcoiled parallel helices of the C-terminal domain. The model is consistent withthe dimensions expected for packaging large viral genomes and provides arationale to interpret the apparent pleomorphic nature of coronaviruses. In the present article a mathematical model is proposed to research thecurrent coronavirus outbreak (SARS-CoV-2) in Paraguay, describing the multipletransmission paths in the infection dynamics, following the susceptible,exposed, infectious, hospitalized, with lost immunity and recoveredindividuals, as well as the role of the virus in the environment and deathsfrom COVID-19 or other reasons. In order to reflect the impact of the controlmeasures adopted by the government and the population, the model employsvariable transmission rates that change with the epidemiological status andenvironmental conditions. The model is validated, and its application isdemonstrated with data publicly available. We release our COVID-19 news dataset, containing more than 10,000 links tonews articles related to the Coronavirus pandemic published in the Swiss mediasince early January 2020. This collection can prove beneficial in mining andanalysis of the reaction of the Swiss media and the COVID-19 pandemic andextracting insightful information for further research. We hope this datasethelps researchers and the public deliver results that will help analyse thepandemic and potentially lead to a better understanding of the events. Since two people came down a county of north Seattle with positive COVID-19(coronavirus-19) in 2019, the current total cases in the United States (U.S.)are over 12 million. Predicting the pandemic trend under effective variables iscrucial to help find a way to control the epidemic. Based on availableliterature, we propose a validated Vector Autoregression (VAR) time seriesmodel to predict the positive COVID-19 cases. A real data prediction for U.S.is provided based on the U.S. coronavirus data. The key message from our studyis that the situation of the pandemic will getting worse if there is noeffective control. This paper examines the impact of coronavirus (COVID-19) on stock marketvolatility (SMV) in Pakistan by controlling the effect of exchange rate,interest rate and government/central bank interventions to combat the pandemic.We used the vector autoregressive (VAR) model over a sample period ranging fromFebruary 25, 2020 to December 7, 2020. We find that a shock to total dailycoronavirus cases in Pakistan lead to a significant increase in SMV. Thisresult is aligned with a vast literature on pandemics and investors uncertaintyand remains robust to several robustness checks applied in our analysis. CoV2019 has evolved to be much more dangerous than CoV2003. Experimentssuggest that structural rearrangements dramatically enhance CoV2019 activity.We identify a new first stage of infection that precedes structuralrearrangements by using biomolecular evolutionary theory to identify sequencedifferences enhancing viral attachment rates. We find a small cluster of foursingle mutations which show that CoV-2 has a new feature that promotes muchstronger viral attachment and enhances contagiousness. The extremely dangerousdynamics of human coronavirus infection is a dramatic example of evolutionaryapproach of self-organized networks to criticality. It may favor a verysuccessful vaccine. The identified mutations can be used to test the presenttheory experimentally. The theory also works well for the newer strains andexplains their increased contagiousness. Since the end of 2019 an outbreak of a new strain of coronavirus, called2019--nCoV, is reported from China and later other parts of the world. SinceJanuary 21, WHO reports daily data on confirmed cases and deaths from bothChina and other countries. In this work we present some discrete and continuousmodels to discribe the disease dynamics in China and estimate the neededepidemiological parameters. Good agreement with the current dynamics has befound for both a discrete transmission model and a slightly modified SIR-model. The outbreak of novel coronavirus (2019-nCoV) in China has caused a viralepidemic affecting tens of thousands of persons. Though the danger of thisepidemic is evident, the statistical analysis of data offered in this paperindicates that the increase in new cases in China will stabilize in the comingdays or weeks. Our forecast could serve to evaluate risks and control theevolution of this disease. After the sudden outbreak of Coronavirus in Wuhan, continuous and rich dataof the epidemic has been made public as the vital fact for decision support incontrol measures and aggressive implementation of containment strategies andplans. With the further growth and spreading of the virus, future resourceallocation and planning under updated strategies and measures rely on carefulstudy of the epidemic data and characteristics for accurate prediction andestimation. By using the SIR model and reported data, key parameters areobtained from least sum of squared errors for an accurate prediction ofepidemic trend in the last four weeks. The novel Coronavirus COVID-19 spreading rapidly throughout the world wasrecognized by the World Health Organization (WHO) as a pandemic on March 11,2020. One month into the COVID-19 pandemic, this white paper looks at theinitial impacts COVID-19 has had on transportation systems in the metropolitanarea of New York, which has become the U.S. epicenter of the coronavirus. In 2022 new subvariants of Coronavirus appeared in South Africa, and spreadrapidly to other parts of the world. The effects of selective evolution onincreasing the already high contagiousness of CoV19 up to Omicron werepreviously discussed with high accuracy using concepts new to molecular biology(from mathematics and physics) that have been developed over the last fewdecades. Here we discuss the new subvariants, and find novel featuressuccessfully combining both improved flexibility and improved stability. Novel coronavirus-19 (2019-nCoV or COVID-19) is by far the most dangerouscoronavirus ever identified for the third time in the three decades capable ofinfecting not only the animals but also the humans across the globe. Nearly6000 deaths have been recorded due mainly to COVID-19 outbreak worldwide andmore than 50% of these deaths appeared to have evolved from China where thevirus was thought to originate. The endemicity of COVID-19 dramaticallysurpassed severe acute respiratory syndrome coronavirus (SARS-CoV) and MiddleEast respiratory syndrome coronavirus (MERS-CoV) that were so far discovered in2003 and 2012 respectively. Thus, the World Health Organization (WHO) hasdeclared the 2019-nCoV outbreak not only a public health emergency but alsopandemic in nature. Currently, over 120 countries including Nigeria werereported to have more than 157,844 confirmed cases and 5,846 deaths due mainlyto COVID-19 outbreak as of March 15, 2020, 10:55 GMT. Artificial Intelligence(AI) is widely used to aid in the prediction, detection, response, recovery ofdisease and making clinical diagnosis. In this study, we highlighted the powerof AI in the containment and mitigation of the spread of COVID-19 outbreak inAfrican countries such as Nigeria where human to human contact is apparentlyinevitable. The recent zoonotic coronavirus virus outbreak of a novel type [COVID 19] hasnecessitated the adequate understanding of the evolutionary pathway of zoonoticviruses which adversely affects human populations for therapeutic constructs tocombat the pandemic now and in the future. We analyzed conserved domains of thesevere acute respiratory coronavirus 2 [SARS-CoV2] for possible targets ofviral entry inhibition in host cells, evolutionary relationship of humancoronavirus [229E] and zoonotic coronaviruses with SAR-CoV2 as well asevolutionary relationship between selected SARS-CoV 2 genomic data. Conserveddomains with antagonistic action on host innate antiviral cellular mechanismsin SARS-CoV 2 include nsp 11, nsp 13 etc. Also, multiple sequence alignments ofthe spike [S] gene protein of selected candidate zoonotic coronavirusesalongside the S gene protein of the SARs-CoV2 revealed closest evolutionaryrelationship [95.6%] with pangolin coronaviruses [S] gene. Clades formedbetween Wuhan SARS-CoV2 phylogeny data and five others suggests viral entrytrajectory while revealing genomic and protein SARS CoV 2 data from Philippinesas early ancestors. Therefore, phylogeny of SARS-CoV 2 genomic data suggestsprofiling in diverse populations with and without the outbreak alongsidemigration history and racial background for mutation tracking and dating ofviral subtype divergence which is essential for effective management of presentand future zoonotic coronavirus outbreaks. Along with the Coronavirus pandemic, another crisis has manifested itself inthe form of mass fear and panic phenomena, fueled by incomplete and ofteninaccurate information. There is therefore a tremendous need to address andbetter understand COVID-19's informational crisis and gauge public sentiment,so that appropriate messaging and policy decisions can be implemented. In thisresearch article, we identify public sentiment associated with the pandemicusing Coronavirus specific Tweets and R statistical software, along with itssentiment analysis packages. We demonstrate insights into the progress offear-sentiment over time as COVID-19 approached peak levels in the UnitedStates, using descriptive textual analytics supported by necessary textual datavisualizations. Furthermore, we provide a methodological overview of twoessential machine learning (ML) classification methods, in the context oftextual analytics, and compare their effectiveness in classifying CoronavirusTweets of varying lengths. We observe a strong classification accuracy of 91%for short Tweets, with the Naive Bayes method. We also observe that thelogistic regression classification method provides a reasonable accuracy of 74%with shorter Tweets, and both methods showed relatively weaker performance forlonger Tweets. This research provides insights into Coronavirus fear sentimentprogression, and outlines associated methods, implications, limitations andopportunities. As the COVID-19 pandemic is disrupting life worldwide, related onlinecommunities are popping up. In particular, two \"new\" communities, /r/China fluand /r/Coronavirus, emerged on Reddit and have been dedicated to COVID- relateddiscussions from the very beginning of this pandemic. With /r/Coronaviruspromoted as the official community on Reddit, it remains an open question howusers choose between these two highly-related communities.  In this paper, we characterize user trajectories in these two communitiesfrom the beginning of COVID-19 to the end of September 2020. We show that newusers of /r/China flu and /r/Coronavirus were similar from January to March.After that, their differences steadily increase, evidenced by both languagedistance and membership prediction, as the pandemic continues to unfold.Furthermore, users who started at /r/China flu from January to March were morelikely to leave, while those who started in later months tend to remain highly\"loyal\". To understand this difference, we develop a movement analysisframework to understand membership changes in these two communities andidentify a significant proportion of /r/China flu members (around 50%) thatmoved to /r/Coronavirus in February. This movement turns out to be highlypredictable based on other subreddits that users were previously active in. Ourwork demonstrates how two highly-related communities emerge and develop theirown identity in a crisis, and highlights the important role of existingcommunities in understanding such an emergence. We comparatively analyzed the spatiotemporal fluctuations of the 2019-novelcoronavirus (COVID-19) and SARS outbreaks to understand their epidemiologicalcharacteristics. Methodologically, we introduced TPL (Taylor power law) tocharacterize their spatiotemporal heterogeneity/stability and Hubbell (2001)unified neutral theory of biodiversity (UNTB) [specifically Harris et al.(2015) HDP-MSN model (hierarchical Dirichlet process multi-site neutral model)]to approximate the metapopulation of coronavirus infections. First, TPLanalysis suggested that the coronaviruses appear to have a specificheterogeneity/stability scaling parameter (TPL-b) slightly exceeding 2 forcumulative infections or exceeding 1 for daily incremental infections,suggesting their potentially chaotic, unstable outbreaks. Another TPL parameter(M0) (i.e., infection critical threshold) depends on virus kinds(COVID-19/SARS), time (disease-stages), space (regions) and public-healthinterventions (e.g., quarantines and mobility control). M0 measures theinfection level, at which infections are random (Poisson distribution) andbelow which infections follow uniform distribution and may die off if M0coincides or below the level of Allee effects. It was found that COVID-19outbreak seems nearly twice more risky than SARS, and the lower infectionthreshold may be due to its lower lethality than SARS since lower fatalityrates can facilitate the survival and spread of pathogen. Second, metacommunityUNTB neutrality testing seems appropriate for approximating metapopulation ofcoronavirus infections. Specifically, two parameters {\\theta} and M, borrowedfrom neutral theory, may be used to assess the relative significance ofinfection through local contagion vs. infection through migration, both ofwhich may depend on time, space, virus kinds, and particularly public-healthinterventions. The recent emergence of a new coronavirus, COVID-19, has gained extensivecoverage in public media and global news. As of 24 March 2020, the virus hascaused viral pneumonia in tens of thousands of people in Wuhan, China, andthousands of cases in 184 other countries and territories. This study exploresthe potential use of Google Trends (GT) to monitor worldwide interest in thisCOVID-19 epidemic. GT was chosen as a source of reverse engineering data, giventhe interest in the topic. Current data on COVID-19 is retrieved from (GT)using one main search topic: Coronavirus. Geographical settings for GT areworldwide, China, South Korea, Italy and Iran. The reported period is 15January 2020 to 24 March 2020. The results show that the highest worldwide peakin the first wave of demand for information was on 31 January 2020. After thefirst peak, the number of new cases reported daily rose for 6 days. A secondwave started on 21 February 2020 after the outbreaks were reported in Italy,with the highest peak on 16 March 2020. The second wave is six times as big asthe first wave. The number of new cases reported daily is rising day by day.This short communication gives a brief introduction to how the demand forinformation on coronavirus epidemic is reported through GT. The Coronavirus pandemic has affected the normal course of life. Peoplearound the world have taken to social media to express their opinions andgeneral emotions regarding this phenomenon that has taken over the world bystorm. The social networking site, Twitter showed an unprecedented increase intweets related to the novel Coronavirus in a very short span of time. Thispaper presents the global sentiment analysis of tweets related to Coronavirusand how the sentiment of people in different countries has changed over time.Furthermore, to determine the impact of Coronavirus on daily aspects of life,tweets related to Work From Home (WFH) and Online Learning were scraped and thechange in sentiment over time was observed. In addition, various MachineLearning models such as Long Short Term Memory (LSTM) and Artificial NeuralNetworks (ANN) were implemented for sentiment classification and theiraccuracies were determined. Exploratory data analysis was also performed for adataset providing information about the number of confirmed cases on a per-daybasis in a few of the worst-hit countries to provide a comparison between thechange in sentiment with the change in cases since the start of this pandemictill June 2020. The appearance of a novel coronavirus in late 2019 radically changed thecommunity of researchers working on coronaviruses since the 2002 SARS epidemic.In 2020, coronavirus-related publications grew by 20 times over the previoustwo years, with 130,000 more researchers publishing on related topics. TheUnited States, the United Kingdom and China led dozens of nations working oncoronavirus prior to the pandemic, but leadership consolidated among thesethree nations in 2020, which collectively accounted for 50% of all papers,garnering well more than 60% of citations. China took an early lead on COVID-19research, but dropped rapidly in production and international participationthrough the year. Europe showed an opposite pattern, beginning slowly inpublications but growing in contributions during the year. The share ofinternationally collaborative publications dropped from pre-pandemic rates;single-authored publications grew. For all nations, including China, the numberof publications about COVID track closely with the outbreak of COVID-19 cases.Lower-income nations participate very little in COVID-19 research in 2020.Topic maps of internationally collaborative work show the rise of patient careand public health clusters, two topics that were largely absent fromcoronavirus research in the two years prior to 2020. Findings are consistentwith global science as a self-organizing system operating on a reputation-baseddynamic. To model the spread of COVID-19 coronavirus in Russian regions and in Moscow,a discrete logistic equation describing the increase in the number of cases isused. To check the adequacy of the mathematical model, the simulation resultswere compared with the spread of coronavirus in China, in a number of Europeanand Asian countries, and the United States. The parameters of the logisticsequation for Russia, Moscow and other large regions were determined in theinterval (01.03 - 08.04). A comparative analysis of growth rates of COVID-19infected population for different countries and regions is presented. Variousscenarios of the spread of COVID-19 coronavirus in Moscow and in the regions ofRussia are considered. For each scenario, curves for the daily new cases andgraphs for the increase in the total number of cases were obtained, and thedynamics of infection spread by day was studied. Peak times, epidemic periods,the number of infected people at the peak and their growth were determined. The novel coronavirus (COVID-19) pandemic outbreak is drastically shaping andreshaping many aspects of our life, with a huge impact on our social life. Inthis era of lockdown policies in most of the major cities around the world, wesee a huge increase in people and professional engagement in social media.Social media is playing an important role in news propagation as well askeeping people in contact. At the same time, this source is both a blessing anda curse as the coronavirus infodemic has become a major concern, and is alreadya topic that needs special attention and further research. In this paper, weprovide a multilingual coronavirus (COVID-19) Instagram dataset that we havebeen continuously collected since March 30, 2020. We are making our datasetavailable to the research community at Github. We believe that thiscontribution will help the community to better understand the dynamics behindthis phenomenon in Instagram, as one of the major social media. This datasetcould also help study the propagation of misinformation related to thisoutbreak. In this paper, a 3D-RegNet-based neural network is proposed for diagnosingthe physical condition of patients with coronavirus (Covid-19) infection. Inthe application of clinical medicine, lung CT images are utilized bypractitioners to determine whether a patient is infected with coronavirus.However, there are some laybacks can be considered regarding to this diagnosticmethod, such as time consuming and low accuracy. As a relatively large organ ofhuman body, important spatial features would be lost if the lungs werediagnosed utilizing two dimensional slice image. Therefore, in this paper, adeep learning model with 3D image was designed. The 3D image as input data wascomprised of two-dimensional pulmonary image sequence and from which relevantcoronavirus infection 3D features were extracted and classified. The resultsshow that the test set of the 3D model, the result: f1 score of 0.8379 and AUCvalue of 0.8807 have been achieved. The ongoing global pandemic of infection disease COVID-19 caused by the 2019novel coronavirus (SARS-COV-2, formerly 2019-nCoV) presents critical threats topublic health and the economy since it was identified in China, December 2019.The genome of SARS-CoV-2 had been sequenced and structurally annotated, yetlittle is known of the intrinsic organization and evolution of the genome. Tothis end, we present a mathematical method for the genomic spectrum, a kind ofbarcode, of SARS-CoV-2 and common human coronaviruses. The genomic spectrum isconstructed according to the periodic distributions of nucleotides, andtherefore reflects the unique characteristics of the genome. The resultsdemonstrate that coronavirus SARS-CoV-2 exhibits dinucleotide TT islands in thenon-structural proteins 3, 4, 5, and 6. Further analysis of the dinucleotideregions suggests that the dinucleotide repeats are increased during evolutionand may confer the evolutionary fitness of the virus. The special dinucleotideregions in the SARS-CoV-2 genome identified in this study may become diagnosticand pharmaceutical targets in monitoring and curing the COVID-19 disease. SARS-CoV2, which causes coronavirus disease (COVID-19) is continuing tospread globally and has become a pandemic. People have lost their lives due tothe virus and the lack of counter measures in place. Given the increasingcaseload and uncertainty of spread, there is an urgent need to develop machinelearning techniques to predict the spread of COVID-19. Prediction of the spreadcan allow counter measures and actions to be implemented to mitigate the spreadof COVID-19. In this paper, we propose a deep learning technique, called DeepSequential Prediction Model (DSPM) and machine learning based Non-parametricRegression Model (NRM) to predict the spread of COVID-19. Our proposed modelswere trained and tested on novel coronavirus 2019 dataset, which contains 19.53Million confirmed cases of COVID-19. Our proposed models were evaluated byusing Mean Absolute Error and compared with baseline method. Our experimentalresults, both quantitative and qualitative, demonstrate the superior predictionperformance of the proposed models. The coronavirus SARS-CoV-2 remains an extant threat against public health ona global scale. Cell infection begins when the spike protein of SARS-CoV-2binds with the cell receptor, angiotensin-converting enzyme 2 (ACE2). Here, weaddress the role of Tetracycline as an inhibitor for the receptor-bindingdomain (RBD) of the spike protein. Targeted molecular investigation show thatTetracycline binds more favorably to the RBD (-9.40 kcal/mol) compared toChloroquine (-6.31 kcal/mol) or Doxycycline (-8.08 kcal/mol) and inhibitsattachment to ACE2 to a greater degree (binding efficiency of 2.98$\\frac{\\text{kcal}}{\\text{mol}\\cdot \\text{nm}^2}$ for Tetracycline-RBD, 5.59$\\frac{\\text{kcal}}{\\text{mol}\\cdot \\text{nm}^2}$ for Chloroquine-RBD, 5.16$\\frac{\\text{kcal}}{\\text{mol}\\cdot \\text{nm}^2}$ for Doxycycline-RBD).Stronger Tetracycline inhibition is verified with nonequilibrium PMFcalculations, for which the Tetracycline-RBD complex exhibits the lowest freeenergy profile along the dissociation pathway from ACE2. Tetracycline appearsto target viral residues that are usually involved in significant hydrogenbonding with ACE2; this inhibition of cellular infection complements theanti-inflammatory and cytokine suppressing capability of Tetracycline, and mayfurther reduce the duration of ICU stays and mechanical ventilation induced bythe coronavirus SARS-CoV-2. Controversial understandings of the coronavirus pandemic have turned datavisualizations into a battleground. Defying public health officials,coronavirus skeptics on US social media spent much of 2020 creating datavisualizations showing that the government's pandemic response was excessiveand that the crisis was over. This paper investigates how pandemicvisualizations circulated on social media, and shows that people who mistrustthe scientific establishment often deploy the same rhetorics of data-drivendecision-making used by experts, but to advocate for radical policy changes.Using a quantitative analysis of how visualizations spread on Twitter and anethnographic approach to analyzing conversations about COVID data on Facebook,we document an epistemological gap that leads pro- and anti-mask groups to drawdrastically different inferences from similar data. Ultimately, we argue thatthe deployment of COVID data visualizations reflect a deeper sociopoliticalrift regarding the place of science in public life. How has the science system reacted to the early stages of the COVID-19pandemic? Here we compare the (growing) international network for coronavirusresearch with the broader international health science network. Our findingsshow that, before the outbreak, coronavirus research realized a relativelysmall and rather peculiar niche within the global health sciences. As aresponse to the pandemic, the international network for coronavirus researchexpanded rapidly along the hierarchical structure laid out by the global healthscience network. Thus, in face of the crisis, the global health science systemproved to be structurally stable yet versatile in research. The observedversatility supports optimistic views on the role of science in meeting futurechallenges. However, the stability of the global core-periphery structure maybe worrying, because it reduces learning opportunities and social capital ofscientifically peripheral countries -- not only during this pandemic but alsoin its \"normal\" mode of operation. The novel coronavirus (SARS-CoV-2) which causes COVID-19 is an ongoingpandemic. There are ongoing studies with up to hundreds of publicationsuploaded to databases daily. We are exploring the use-case of artificialintelligence and natural language processing in order to efficiently sortthrough these publications. We demonstrate that clinical trial information,preclinical studies, and a general topic model can be used as text mining dataintelligence tools for scientists all over the world to use as a resource fortheir own research. To evaluate our method, several metrics are used to measurethe information extraction and clustering results. In addition, we demonstratethat our workflow not only have a use-case for COVID-19, but for other diseaseareas as well. Overall, our system aims to allow scientists to more efficientlyresearch coronavirus. Our automatically updating modules are available on ourinformation portal at https://ghddi-ailab.github.io/Targeting2019-nCoV/ forpublic viewing. Biosignals are nowadays important subjects for scientific researches fromboth theory and applications especially with the appearance of new pandemicsthreatening humanity such as the new Coronavirus. One aim in the present workis to prove that Wavelets may be successful machinery to understand suchphenomena by applying a step forward extension of wavelets to multiwavelets. Weproposed in a first step to improve the multiwavelet notion by constructingmore general families using independent components for multi-scaling andmultiwavelet mother functions. A special multiwavelet is then introduced,continuous and discrete multiwavelet transforms are associated, as well as newfilters and algorithms of decomposition and reconstruction. The constructedmultiwavelet framework is applied for some experimentations showing fastalgorithms, ECG signal, and a strain of Coronavirus processing. The recent emergence of a new coronavirus (COVID-19) has gained a high coverin public media and worldwide news. The virus has caused a viral pneumonia intens of thousands of people in Wuhan, a central city of China. This short papergives a brief introduction on how the demand for information on this newepidemic is reported through Google Trends. The reported period is 31 December2020 to 20 March 2020. The authors draw conclusions on current infodemiologicaldata on COVID-19 using three main search keywords: coronavirus, SARS and MERS.Two approaches are set. First is the worldwide perspective, second - theChinese one, which reveals that in China this disease in the first days wasmore often referred to SARS then to general coronaviruses, whereas worldwide,since the beginning, it is more often referred to coronaviruses. Motivation: The coronavirus disease 2019 (COVID-19) caused by a new type ofcoronavirus has been emerging from China and led to thousands of death globallysince December 2019. Despite many groups have engaged in studying the newlyemerged virus and searching for the treatment of COVID-19, the understanding ofthe COVID-19 target-ligand interactions represents a key chal-lenge. Herein, weintroduce COVID-19 Docking Server, a web server that predicts the binding modesbetween COVID-19 targets and the ligands including small molecules, peptidesand anti-bodies. Results: Structures of proteins involved in the virus lifecycle were collected or constructed based on the homologs of coronavirus, andprepared ready for docking. The meta platform provides a free and interactivetool for the prediction of COVID-19 target-ligand interactions and followingdrug discovery for COVID-19. Coronavirus (COVID-19) creates fear and uncertainty, hitting the globaleconomy and amplifying the financial markets volatility. The oil price reactionto COVID-19 was gradually accommodated until March 09, 2020, when, 49 daysafter the release of the first coronavirus monitoring report by the WorldHealth Organization (WHO), Saudi Arabia floods the market with oil. As aresult, international prices drop with more than 20% in one single day. Againstthis background, the purpose of this paper is to investigate the impact ofCOVID-19 numbers on crude oil prices, while controlling for the impact offinancial volatility and the United States (US) economic policy uncertainty.Our ARDL estimation shows that the COVID-19 daily reported cases of newinfections have a marginal negative impact on the crude oil prices in the longrun. Nevertheless, by amplifying the financial markets volatility, COVID-19also has an indirect effect on the recent dynamics of crude oil prices. In mid of March 2020, Coronaviruses such as COVID-19 is declared as aninternational epidemic. More than 125000 confirmed cases and 4,607 death caseshave been recorded around more than 118 countries. Unfortunately, a coronavirusvaccine is expected to take at least 18 months if it works at all. Moreover,COVID -19 epidemics can mutate into a more aggressive form. Day levelinformation about the COVID -19 spread is crucial to measure the behavior ofthis new virus globally. Therefore, this study presents a comparison of daylevel forecasting models on COVID-19 affected cases using time series modelsand mathematical formulation. The forecasting models and data strongly suggestthat the number of coronavirus cases grows exponentially in countries that donot mandate quarantines, restrictions on travel and public gatherings, andclosing of schools, universities, and workplaces (Social Distancing). The emerging global infectious COVID-19 coronavirus disease by novel SevereAcute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) presents critical threatsto global public health and the economy since it was identified in lateDecember 2019 in China. The virus has gone through various pathways ofevolution. For understanding the evolution and transmission of SARS-CoV-2,genotyping of virus isolates is of great importance. We present an accuratemethod for effectively genotyping SARS-CoV-2 viruses using complete genomes.The method employs the multiple sequence alignments of the genome isolates withthe SARS-CoV-2 reference genome. The SNP genotypes are then measured by Jaccarddistances to track the relationship of virus isolates. The genotyping analysisof SARS-CoV-2 isolates from the globe reveals that specific multiple mutationsare the predominated mutation type during the current epidemic. Our methodserves a promising tool for monitoring and tracking the epidemic of pathogenicviruses in their gradual and local genetic variations. The genotyping analysisshows that the genes encoding the S proteins and RNA polymerase, RNA primase,and nucleoprotein, undergo frequent mutations. These mutations are critical forvaccine development in disease control. We provide a new investigation of the relationship between oil and stockprices in the context of the outbreak of the new coronavirus crisis.Specifically, we assess to what extent the uncertainty induced by COVID-19affects the interaction between oil and the United States (US) stock markets.To this end, we use a wavelet approach and daily data from February 18, 2020 toAugust 15, 2020. We identify the lead-lag relationship between oil and stockprices, and the intensity of this relationship at different frequency cyclesand moments in time. Our unique findings show that co-movements between oil andstock prices manifest at 3-5-day cycle and are stronger in the first part ofMarch and the second part of April 2020, when oil prices are leading stockprices. The partial wavelet coherence analysis, controlling for the effect ofCOVID-19 and US economic policy-induced uncertainty, reveals that thecoronavirus crisis amplifies the shock propagation between oil and stockprices. Facing the world wide coronavirus disease 2019 (COVID-19) pandemic, a newfitting method (QDF, quasi-distribution fitting) which could be used to analyzethe data of COVID-19 is developed based on piecewise quasi-uniform B-splinecurves. For any given country or district, it simulates the distributionhistogram data which is made from the daily confirmed cases (or the other dataincluding daily recovery cases and daily fatality cases) of the COVID-19 withpiecewise quasi-uniform B-spline curves. Being dealt with area normalizationmethod, the fitting curves could be regarded as a kind of probability densityfunction (PDF), its mathematical expectation and the variance could be used toanalyze the situation of the coronavirus pandemic. Numerical experiments basedon the data of certain countries have indicated that the QDF method demonstratethe intrinsic characteristics of COVID-19 data of the given country or distric,and because of the interval of data used in this paper is over one year (500days), it reveals the fact that after multi-wave transmission of thecoronavirus, the case fatality rate has declined obviously, the result showsthat as an appraisal method, it is effective and feasible. The coronavirus Covid-19 mutates quickly in the pandemic, leaves peoplestruggling to verify and improve the effectiveness of the vaccine based onbiochemistry. Is there any physical invariant in the variants of such kind ofpathogen that could be taken advantage to ease the tensions? To this point,extensive numerical experiments based on continuity mechanics were carried outto discover the vibration modes and the range of natural frequency ofcoronavirus Covid-19. Such invariant could help us in developing some flexibletechnique to deactivate the coronavirus, like as resonantly breaking the viralspike by ultrasound wave. The fundamental mechanisms governing such process aredemonstrated via solving the coupled equations of acoustics and dynamics andthereafter the technique strategies proposed to efficiently realize theconcept. This paper presents a federated learning (FL) approach to train an AI modelfor SARS-Cov-2 variant classification. We analyze the SARS-CoV-2 spikesequences in a distributed way, without data sharing, to detect differentvariants of this rapidly mutating coronavirus. Our method maintains theconfidentiality of local data (that could be stored in different locations) yetallows us to reliably detect and identify different known and unknown variantsof the novel coronavirus SARS-CoV-2. Using the proposed approach, we achieve anoverall accuracy of $93\\%$ on the coronavirus variant identification task. Wealso provide details regarding how the proposed model follows the main laws offederated learning, such as Laws of data ownership, data privacy, modelaggregation, and model heterogeneity. Since the proposed model is distributed,it could scale on ``Big Data'' easily. We plan to use this proof-of-concept toimplement a privacy-preserving pandemic response strategy. The novel Coronavirus Disease 2019 (COVID-19) is a global pandemic diseasespreading rapidly around the world. A robust and automatic early recognition ofCOVID-19, via auxiliary computer-aided diagnostic tools, is essential fordisease cure and control. The chest radiography images, such as ComputedTomography (CT) and X-ray, and deep Convolutional Neural Networks (CNNs), canbe a significant and useful material for designing such tools. However,designing such an automated tool is challenging as a massive number of manuallyannotated datasets are not publicly available yet, which is the corerequirement of supervised learning systems. In this article, we propose arobust CNN-based network, called CVR-Net (Coronavirus Recognition Network), forthe automatic recognition of the coronavirus from CT or X-ray images. Theproposed end-to-end CVR-Net is a multi-scale-multi-encoder ensemble model,where we have aggregated the outputs from two different encoders and theirdifferent scales to obtain the final prediction probability. We train and testthe proposed CVR-Net on three different datasets, where the images havecollected from different open-source repositories. We compare our proposedCVR-Net with state-of-the-art methods, which are trained and tested on the samedatasets. We split three datasets into five different tasks, where each taskhas a different number of classes, to evaluate the multi-tasking CVR-Net. Ourmodel achieves an overall F1-score & accuracy of 0.997 & 0.998; 0.963 & 0.964;0.816 & 0.820; 0.961 & 0.961; and 0.780 & 0.780, respectively, for task-1 totask-5. As the CVR-Net provides promising results on the small datasets, it canbe an auspicious computer-aided diagnostic tool for the diagnosis ofcoronavirus to assist the clinical practitioners and radiologists. Our sourcecodes and model are publicly available athttps://github.com/kamruleee51/CVR-Net. Globally the SARS-CoV-2 coronavirus has infected more than 59 million peopleand killed more than 1.39 million. Designing and monitoring interventions toslow and stop the spread of the virus require knowledge of how many people havebeen and are currently infected, where they live, and how they interact. Thefirst step is an accurate assessment of the population prevalence of pastinfections. There are very few population-representative prevalence studies ofthe SARS-CoV-2 coronavirus, and only two American states -- Indiana andConnecticut -- have reported probability-based sample surveys that characterizestate-wide prevalence of the SARS-CoV-2 coronavirus. One of the difficulties isthe fact that the tests to detect and characterize SARS-CoV-2 coronavirusantibodies are new, not well characterized, and generally function poorly.During July, 2020, a survey representing all adults in the State of Ohio in theUnited States collected biomarkers and information on protective behaviorrelated to the SARS-CoV-2 coronavirus. Several features of the survey make itdifficult to estimate past prevalence: 1) a low response rate, 2) very lownumber of positive cases, and 3) the fact that multiple, poor qualityserological tests were used to detect SARS-CoV-2 antibodies. We describe a newBayesian approach for analyzing the biomarker data that simultaneouslyaddresses these challenges and characterizes the potential effect of selectiveresponse. The model does not require survey sample weights, accounts formultiple, imperfect antibody test results, and characterizes uncertaintyrelated to the sample survey and the multiple, imperfect, potentiallycorrelated tests. The year 2020 has seen an unprecedented COVID-19 pandemic due to the outbreakof a novel strain of coronavirus in 180 countries. In a desperate effort todiscover new drugs and vaccines for COVID-19, many scientists are workingaround the clock. Their valuable time and effort may benefit fromcomputer-based mining of a large volume of health science literature that is atreasure trove of information. In this paper, we have developed a graph-basedmodel using abstracts of 10,683 scientific articles to find key information onthree topics: transmission, drug types, and genome research related tocoronavirus. A subgraph is built for each of the three topics to extract moretopic-focused information. Within each subgraph, we use a betweennesscentrality measurement to rank order the importance of keywords related todrugs, diseases, pathogens, hosts of pathogens, and biomolecules. The resultsreveal intriguing information about antiviral drugs (Chloroquine, Amantadine,Dexamethasone), pathogen-hosts (pigs, bats, macaque, cynomolgus), viralpathogens (zika, dengue, malaria, and several viruses in the coronaviridaevirus family), and proteins and therapeutic mechanisms (oligonucleotide,interferon, glycoprotein) in connection with the core topic of coronavirus. Thecategorical summary of these keywords and topics may be a useful reference toexpedite and recommend new and alternative directions for COVID-19 research. The novel coronavirus (COVID-19) outbreak is a global pandemic with communitycirculation in many countries, including the U.S. where every state isreporting confirmed cases. The course of this pandemic will be largely shapedby how governments enact timely policies, disseminate the information, and mostimportantly, how the public reacts to them. Here, we examine informationseekingresponses to the first COVID-19 case public announcement in a state. By usingan eventstudy framework, we show that such news increases collective attentionto the crisis right away, but the elevated level of attention is short-lived,even though the initial announcements were followed by increasingly strongmeasures. We find that people respond to the first report of COVID-19 in theirstate by immediately seeking information about COVID-19, as measured bysearches for coronavirus, coronavirus symptoms and hand sanitizer. On the otherhand, searches for information regarding community level policies (e.g.,quarantine, school closures, testing), or personal health strategies (e.g.,masks, grocery delivery, over-the-counter medications) do not appear to beimmediately triggered by first reports. These results are encouraging given ourstudy period is relatively early in the epidemic and more elaborate policyresponses were not yet part of the public discourse. Further analysis willtrack evolving patterns of responses to subsequent flows of public information. COVID-19, a novel coronavirus, is currently a major worldwide threat. It hasinfected more than a million people globally leading to hundred-thousands ofdeaths. In such grave circumstances, it is very important to predict the futureinfected cases to support prevention of the disease and aid in the healthcareservice preparation. Following that notion, we have developed a model and thenemployed it for forecasting future COVID-19 cases in India. The study indicatesan ascending trend for the cases in the coming days. A time series analysisalso presents an exponential increase in the number of cases. It is supposedthat the present prediction models will assist the government and medicalpersonnel to be prepared for the upcoming conditions and have more readiness inhealthcare systems. The worldwide outbreak of the coronavirus was first identified in 2019 inWuhan, China. Since then, the disease has spread worldwide. As it currentlyspreading in the United States, policy makers, public health officials andcitizens are racing to understand the impact of this virus on the United Stateshealthcare system. They fear that the rapid influx of patients will overwhelmthe healthcare system leading to unnecessary fatalities. Most countries andstates in America have introduced mitigation strategies, such as socialdistancing, to decrease the rate of newly infected people, i.e. flattening thecurve.In this paper, we analyze the time evolution of the number of peoplehospitalized due to the coronavirus using the methods of queueing theory. Giventhat the rate of new infections varies over time as the pandemic evolves, wemodel the number of coronavirus patients as a dynamical system based on thetheory of infinite server queues with non-stationary Poisson arrival rates.With this model we are able to quantify how flattening the curve affects thepeak demand for hospital resources. This allows us to characterize howaggressively society must flatten the curve in order to avoid overwhelming thecapacity of healthcare system. We also demonstrate how flattening the curveimpacts the elapsed time between the peak rate of hospitalizations and the timeof the peak demand for the hospital resources. Finally, we present empiricalevidence from China, South Korea, Italy and the United States that supports theinsights from the model. Tropical climates provoke adaptations in skin pigmentation and in mechanismscontrolling the volume, salt-content and pressure of body fluids. For manywhose distant ancestors moved to temperate climes, these adaptations provedharmful: pigmentation decreased by natural selection and susceptibility tohypertension emerged. Now an added risk is lung inflammation from coronavirusthat may be furthered by innate immune differences. Hypertension andcoronavirus have in common angiotensin converting enzyme 2 (ACE2), whichdecreases blood pressure and mediates virus entry. In keeping with lessdetailed studies, a long-term case-report shows that decreased blood pressureinduced by blocking a primary angiotensin receptor is supplemented, abovecritical blocker dosage, by a further temperature-dependent fall, likelymediated by ACE2 and secondary angiotensin receptors. Temperature-dependencesuggests a linkage with tropical heritage and an influence of blockers on theprogress of coronavirus infections. Positive therapeutic results should resultfrom negation of host pro-inflammatory effects mediated by the primaryangiotensin receptor and concomitant promotion of countervailinganti-inflammatory effects mediated by ACE2 through other receptors. Theseeffects may involve innate immune system components (lectin complement pathway,NAD metabolome). Black vulnerability - more likely based on physiological thanon socioeconomic differences - provides an important clue that may guidetreatments. Coronavirus becomes officially a global pandemic due to the speed spreadingoff in various countries. An increasing number of infected with this diseasecauses the Inability problem to fully care in hospitals and afflict manydoctors and nurses inside the hospitals. This paper proposes a smart healthsystem that monitors the patients holding the Coronavirus remotely. Due toprotect the lives of the health services members (like physicians and nurses)from infection. This smart system observes the people with this disease basedon putting many sensors to record many features of their patients in everysecond. These parameters include measuring the patient's temperature,respiratory rate, pulse rate, blood pressure, and time. The proposed systemsaves lives and improves making decisions in dangerous cases. It proposes usingartificial intelligence and Internet-of-things to make remotely quarantine anddevelop decisions in various situations. It provides monitoring patientsremotely and guarantees giving patients medicines and getting complete healthcare without anyone getting sick with this disease. It targets two people'sslides the most serious medical conditions and infection and the lowest seriousmedical conditions in their houses. Observing in hospitals for the most seriousmedical cases that cause infection in thousands of healthcare members so thereis a big need to uses it. Other less serious patients slide, this systemenables physicians to monitor patients and get the healthcare from patient'shouses to save places for the critical cases in hospitals. Now that various countries are or will soon be moving towards relaxingshelter-in-place rules, it is important that people use a face covering, toavoid an exponential resurgence of the spreading of the coronavirus disease(COVID-19). Here we report a pre-registered online experiment (N=2,459) using aheterogenous, although not representative, sample of people living in the USA,where we test the relative effect of messages highlighting that the coronavirusis a threat to \"you\" vs \"your family\" vs \"your community\" vs \"your country\" onself-reported intentions to wear a face covering. Results show that focusing on\"your community\" promotes intentions to wear a face covering relative to thebaseline; the trend is the same when comparing \"your community\" to the otherconditions, but not significant. We also conducted pre-registered analyses ofgender differences on intentions to wear a face covering. We find that men lessthan women intend to wear a face covering, but this difference almostdisappears in counties where wearing a face covering is mandatory. We also findthat men less than women believe that they will be seriously affected by thecoronavirus, and this partly mediates gender differences in intentions to weara face covering (this is particularly ironic because official statisticsactually show that men are affected by the COVID-19 more seriously than women).Finally, we also find gender differences in self-reported negative emotionsfelt when wearing a face covering. Men more than women agree that wearing aface covering is shameful, not cool, a sign of weakness, and a stigma; andthese gender differences also mediate gender differences in intentions to weara face covering. Nowadays, the coronavirus pandemic has and is still causing large numbers ofdeaths and infected people. Although governments all over the world have takensevere measurements to slow down the virus spreading (e.g., travelrestrictions, suspending all sportive, social, and economic activities,quarantines, social distancing, etc.), a lot of persons have died and a lotmore are still in danger. Indeed, a recently conducted study~\\cite{ref2} hasreported that 79\\% of the confirmed infections in China were caused byundocumented patients who had no symptoms. In the same context, in numerousother countries, since coronavirus takes several days before the emergence ofsymptoms, it has also been reported that the known number of infections is notrepresentative of the real number of infected people (the actual number isexpected to be much higher). That is to say, asymptomatic patients are the mainfactor behind the large quick spreading of coronavirus and are also the majorreason that caused governments to lose control over this critical situation. Tocontribute to remedying this global pandemic, in this paper, we propose an IoT(Internet of Things) investigation system that was specifically designed tospot both undocumented patients and infectious places. The goal is to help theauthorities to disinfect high-contamination sites and confine persons even ifthey have no apparent symptoms. The proposed system also allows determining allpersons who had close contact with infected or suspected patients.Consequently, rapid isolation of suspicious cases and more efficient controlover any pandemic propagation can be achieved. This study endeavors to explain the relation between air pollution andparticulate compounds emissions, wind resources and energy, and the diffusionof COVID-19 infection to provide insights of sustainable policy to preventfuture epidemics. The statistical analysis here focuses on case study of Italy,one of the countries to experience a rapid increase in confirmed cases anddeaths. Results reveal two main findings: 1) cities in regions with high windspeed and a high wind energy production in MW have a lower number of infectedindividuals of COVID-19 infection and total deaths; 2) cities located inhinterland zones (mostly those bordering large urban conurbations) with highpolluting industrialization, low wind speed and less cleaner production have agreater number of infected individuals and total deaths. Hence, cities withpollution industrialization and low renewable energy have also to consider lowwind speed and other climatological factors that can increase stagnation of theair in the atmosphere with potential problems for public health in the presenceof viral agents. Results here suggest that current pandemic of Coronavirusdisease and future epidemics similar to COVID-19 infection cannot be solvedonly with research and practice of medicine, immunology and microbiology butalso with a proactive strategy directed to interventions for a sustainabledevelopment. Overall, then, this study has to conclude that a strategy toprevent future epidemics similar to COVID-19 infection must also be based onsustainability science to support a higher level of renewable energy andcleaner production to reduce polluting industrialization and, as result, thefactors determining the spread of coronavirus disease and other infections insociety. The novel severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), whichcauses coronavirus disease 2019 (COVID-19), is a threat to the globalhealthcare system and economic security. As of July 2020, no specific drugs orvaccines are yet available for COVID-19, fast and accurate diagnosis forSARS-CoV-2 is essential in slowing down the spread of COVID-19 and forefficient implementation of control and containment strategies. Magneticimmunoassay is a novel and emerging topic representing the frontiers of currentbiosensing and magnetics areas. The past decade has seen rapid growth inapplying magnetic tools for biological and biomedical applications. Recentadvances in magnetic materials and nanotechnologies have transformed currentdiagnostic methods to nanoscale and pushed the detection limit to early stagedisease diagnosis. Herein, this review covers the literatures of magneticimmunoassay platforms for virus and pathogen detections, before COVID-19. Wereviewed the popular magnetic immunoassay platforms including magnetoresistance(MR) sensors, magnetic particle spectroscopy (MPS), and nuclear magneticresonance (NMR). Magnetic Point-of-Care (POC) diagnostic kits are also reviewedaiming at developing plug-and-play diagnostics to manage the SARS-CoV-2outbreak as well as preventing future epidemics. In addition, other platformsthat use magnetic materials as auxiliary tools for enhanced pathogen and virusdetections are also covered. The goal of this review is to inform theresearchers of diagnostic and surveillance platforms for SARS-CoV-2 and theirperformances. Emerged in Wuhan city of China in December 2019, COVID-19 continues to spreadrapidly across the world despite authorities having made available a number ofvaccines. While the coronavirus has been around for a significant period oftime, people and authorities still feel the need for awareness due to themutating nature of the virus and therefore varying symptoms and preventionstrategies. People and authorities resort to social media platforms the most toshare awareness information and voice out their opinions due to their massiveoutreach in spreading the word in practically no time. People use a number oflanguages to communicate over social media platforms based on theirfamiliarity, language outreach, and availability on social media platforms. Theentire world has been hit by the coronavirus and India is the second worst-hitcountry in terms of the number of active coronavirus cases. India, being amultilingual country, offers a great opportunity to study the outreach ofvarious languages that have been actively used across social media platforms.In this study, we aim to study the dataset related to COVID-19 collected in theperiod between February 2020 to July 2020 specifically for regional languagesin India. This could be helpful for the Government of India, various stategovernments, NGOs, researchers, and policymakers in studying different issuesrelated to the pandemic. We found that English has been the mode ofcommunication in over 64% of tweets while as many as twelve regional languagesin India account for approximately 4.77% of tweets. With the rapid spread of the novel coronavirus (COVID-19) across the globeand its continuous mutation, it is of pivotal importance to design a system toidentify different known (and unknown) variants of SARS-CoV-2. Identifyingparticular variants helps to understand and model their spread patterns, designeffective mitigation strategies, and prevent future outbreaks. It also plays acrucial role in studying the efficacy of known vaccines against each variantand modeling the likelihood of breakthrough infections. It is well known thatthe spike protein contains most of the information/variation pertaining tocoronavirus variants.  In this paper, we use spike sequences to classify different variants of thecoronavirus in humans. We show that preserving the order of the amino acidshelps the underlying classifiers to achieve better performance. We also showthat we can train our model to outperform the baseline algorithms using only asmall number of training samples ($1\\%$ of the data). Finally, we show theimportance of the different amino acids which play a key role in identifyingvariants and how they coincide with those reported by the USA's Centers forDisease Control and Prevention (CDC). First identified in Wuhan, China, in December 2019, the outbreak of COVID-19has been declared as a global emergency in January, and a pandemic in March2020 by the World Health Organization (WHO). Along with this pandemic, we arealso experiencing an \"infodemic\" of information with low credibility such asfake news and conspiracies. In this work, we present ReCOVery, a repositorydesigned and constructed to facilitate research on combating such informationregarding COVID-19. We first broadly search and investigate ~2,000 newspublishers, from which 60 are identified with extreme [high or low] levels ofcredibility. By inheriting the credibility of the media on which they werepublished, a total of 2,029 news articles on coronavirus, published fromJanuary to May 2020, are collected in the repository, along with 140,820 tweetsthat reveal how these news articles have spread on the Twitter social network.The repository provides multimodal information of news articles on coronavirus,including textual, visual, temporal, and network information. The way that newscredibility is obtained allows a trade-off between dataset scalability andlabel accuracy. Extensive experiments are conducted to present data statisticsand distributions, as well as to provide baseline performances for predictingnews credibility so that future methods can be compared. Our repository isavailable at http://coronavirus-fakenews.com. Global coronavirus disease pandemic (COVID-19) caused by newly identifiedSARS- CoV-2 coronavirus continues to claim the lives of thousands of peopleworldwide. The unavailability of specific medications to treat COVID-19 has ledto drug repositioning efforts using various approaches, including computationalanalyses. Such analyses mostly rely on molecular docking and require the 3Dstructure of the target protein to be available. In this study, we utilized aset of machine learning algorithms and trained them on a dataset ofRNA-dependent RNA polymerase (RdRp) inhibitors to run inference analyses onantiviral and anti-inflammatory drugs solely based on the ligand information.We also performed virtual screening analysis of the drug candidates predictedby machine learning models and docked them against the active site of SARS-CoV-2 RdRp, a key component of the virus replication machinery. Based on theligand information of RdRp inhibitors, the machine learning models were able toidentify candidates such as remdesivir and baloxavir marboxil, molecules withdocumented activity against RdRp of the novel coronavirus. Among the otheridentified drug candidates were beclabuvir, a non-nucleoside inhibitor of thehepatitis C virus (HCV) RdRp enzyme, and HCV protease inhibitors paritaprevirand faldaprevir. Further analysis of these candidates using molecular dockingagainst the SARS-CoV-2 RdRp revealed low binding energies against the enzymeactive site. Our approach also identified anti-inflammatory drugs lupeol,lifitegrast, antrafenine, betulinic acid, and ursolic acid to have potentialactivity against SARS-CoV-2 RdRp. We propose that the results of this study areconsidered for further validation as potential therapeutic options againstCOVID-19. Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is the strain ofcoronavirus that causes coronavirus disease 2019 (COVID-19), the respiratoryillness responsible for the COVID-19 pandemic. Currently there is no knownvaccine or specific antiviral treatment for COVID-19 and so, there is an urgentneed for expedite discovery of new therapeutics to combat the disease until avaccine will be available worldwide. Drug repurposing is a strategy foridentifying new uses for approved drugs that has the advantage (overconventional approaches that attempt to develop a drug from scratch) that timeframe of the overall process can be significantly reduced because of the fewnumber of clinical trial required. In this work, a virtual screening ofFDA-approved drugs was performed for repositioning as potential inhibitors ofthe main protease Mpro of SARS-CoV-2. As a result of this study, 12 drugs areproposed as candidates for inhibitors of the Mpro enzyme. Some of the selectedcompounds are antiviral drugs that are already being tested in COVID-19clinical trials (i.e. ribavirin) or are used to alleviate symptoms of thedisease (i.e. codeine). Surprisingly, the most promising candidate is thenaturally occurring broad spectrum antibiotic oxytetracycline. This compoundhas largely outperformed the remaining selected candidates along all filteringsteps of our virtual screening protocol. If the activity of any of these drugsis experimentally corroborated, they could be used directly in clinical trialswithout the need for pre-clinical testing or safety evaluation since they arealready used as drugs for other diseases. This study empirically investigates the complex interplay between theseverity of the coronavirus pandemic, mobility changes in retail andrecreation, transit stations, workplaces, and residential areas, and lockdownmeasures in 88 countries of the word. To conduct the study, data on mobilitypatterns, socioeconomic and demographic characteristics of people, lockdownmeasures, and coronavirus pandemic were collected from multiple sources (e.g.,Google, UNDP, UN, BBC, Oxford University, Worldometer). A Structural EquationModeling (SEM) technique is used to investigate the direct and indirect effectsof independent variables on dependent variables considering the interveningeffects of mediators. Results show that lockdown measures have significanteffects to encourage people to maintain social distancing. However, pandemicseverity and socioeconomic and institutional factors have limited effects tosustain social distancing practice. The results also explain that socioeconomicand institutional factors of urbanity and modernity have significant effects onpandemic severity. Countries with a higher number of elderly people, employmentin the service sector, and higher globalization trend are the worst victims ofthe coronavirus pandemic (e.g., USA, UK, Italy, and Spain). Social distancingmeasures are reasonably effective at tempering the severity of the pandemic. As of July 31, 2020, the COVID-19 pandemic has over 17 million reportedcases, causing more than 667,000 deaths. Countries irrespective of economicstatus have succumbed to this pandemic. Many aspects of the lives, includinghealth, economy, freedom of movement have been negatively affected by thecoronavirus outbreak. Numerous strategies have been taken in order to preventthe outbreak. Some countries took severe resections in the form of full-scalelockdown, while others took a moderate approach of dealing with the pandemics,for example, mass testing, prohibiting large-scale public gatherings,restricting international travels. South America adopted primarily the lockdownstrategies due to inadequate economy and health care support. Since the socialinteractions between the people are primarily affected by the lockdown,psychological distress, e.g. anxiety, stress, fear are supposedly affecting theSouth American population in a severe way. This paper aims to explore theimpact of lockdown over the psychological aspect of the people of all theSpanish speaking South American capitals. We have utilized infodemiologyapproach by employing large-scale Twitter data-set over 33 million feeds inorder to understand people's interaction over the months of this on-goingcoronavirus pandemic. Our result is surprising: at the beginning of thepandemic, people demonstrated strong emotions (i.e. anxiety, worry, fear) whichdeclined over time even though the actual pandemic is worsening by having morepositive cases, and inflicting more deaths. This leads us to speculate that theSouth American population is adapting to this pandemic thus improving theoverall psychological distress. With the continued spread of coronavirus, the task of forecasting distinctiveCOVID-19 growth curves in different cities, which remain inadequately explainedby standard epidemiological models, is critical for medical supply andtreatment. Predictions must take into account non-pharmaceutical interventionsto slow the spread of coronavirus, including stay-at-home orders, socialdistancing, quarantine and compulsory mask-wearing, leading to reductions inintra-city mobility and viral transmission. Moreover, recent work associatingcoronavirus with human mobility and detailed movement data suggest the need toconsider urban mobility in disease forecasts. Here we show that byincorporating intra-city mobility and policy adoption into a novelmetapopulation SEIR model, we can accurately predict complex COVID-19 growthpatterns in U.S. cities ($R^2$ = 0.990). Estimated mobility change due topolicy interventions is consistent with empirical observation from AppleMobility Trends Reports (Pearson's R = 0.872), suggesting the utility ofmodel-based predictions where data are limited. Our model also reproduces urban\"superspreading\", where a few neighborhoods account for most secondaryinfections across urban space, arising from uneven neighborhood populations andheightened intra-city churn in popular neighborhoods. Therefore, our model canfacilitate location-aware mobility reduction policy that more effectivelymitigates disease transmission at similar social cost. Finally, we demonstrateour model can serve as a fine-grained analytic and simulation framework thatinforms the design of rational non-pharmaceutical interventions policies. The new coronavirus became a severe health issue for the world. Thissituation has motivated studies of different areas to combat this pandemic. Insoftware engineering, we point out data visualization projects to follow thedisease evolution, machine learning to estimate the pandemic behavior, andcomputer vision processing radiologic images. Most of these projects are storedin version control systems, and there are discussions about them in Question &Answer websites. In this work, we conducted a Mining Software Repository on alarge number of questions and projects aiming to find trends that could helpresearchers and practitioners to fight against the coronavirus. We analyzed1,190 questions from Stack Overflow and Data Science Q\\&A and 60,352 GitHubprojects. We identified a correlation between the questions and projectsthroughout the pandemic. The main questions about coronavirus are how-to,related to web scraping and data visualization, using Python, JavaScript, andR. The most recurrent GitHub projects are machine learning projects, usingJavaScript, Python, and Java. The coronavirus disease (COVID-19) is an unparalleled crisis leading to ahuge number of casualties and security problems. In order to reduce the spreadof coronavirus, people often wear masks to protect themselves. This makes facerecognition a very difficult task since certain parts of the face are hidden. Aprimary focus of researchers during the ongoing coronavirus pandemic is to comeup with suggestions to handle this problem through rapid and efficientsolutions. In this paper, we propose a reliable method based on occlusionremoval and deep learning-based features in order to address the problem of themasked face recognition process. The first step is to remove the masked faceregion. Next, we apply three pre-trained deep Convolutional Neural Networks(CNN) namely, VGG-16, AlexNet, and ResNet-50, and use them to extract deepfeatures from the obtained regions (mostly eyes and forehead regions). TheBag-of-features paradigm is then applied to the feature maps of the lastconvolutional layer in order to quantize them and to get a slightrepresentation comparing to the fully connected layer of classical CNN.Finally, Multilayer Perceptron (MLP) is applied for the classification process.Experimental results on Real-World-Masked-Face-Dataset show high recognitionperformance compared to other state-of-the-art methods. Temporal evolution of the coronavirus literature over the last thirty years(N=43,769) is analyzed along with its subdomain of SARS-CoV-2 articles(N=27,460) and the subdomain of reviews and meta-analytic studies (N=1,027).(i) The analyses on the subset of SARS-CoV-2 literature identified studiespublished prior to 2020 that have now proven highly instrumental in thedevelopment of various clusters of publications linked to SARS-CoV-2. Inparticular, the so-called sleeping beauties of the coronavirus literature withan awakening in 2020 were identified, i.e., previously published studies ofthis literature that had remained relatively unnoticed for several years butgained sudden traction in 2020 in the wake of the SARS-CoV-2 outbreak. (ii) Thesubset of 2020 SARS-CoV-2 articles is bibliographically distant from the restof this literature published prior to 2020. Individual articles of theSARS-CoV-2 segment with a bridging role between the two bodies of articles(i.e., before and after 2020) are identifiable. (iii) Furthermore, the degreeof bibliographic coupling within the 2020 SARS-CoV-2 cluster is much poorercompared to the cluster of articles published prior to 2020. This could, inpart, be explained by the higher diversity of topics that are studied inrelation to SARS-CoV-2 compared to the literature of coronaviruses publishedprior to the SARS-CoV-2 disease. This work demonstrates how scholarly effortsundertaken during peace time or prior to a disease outbreak could suddenly playa critical role in prevention and mitigation of health disasters caused by newdiseases. The SARS-CoV-2 coronavirus, the etiologic agent responsible for COVID-19coronavirus disease, is a global threat. To better understand viral tropism, weassessed the RNA expression of the coronavirus receptor, ACE2, as well as theviral S protein priming protease TMPRSS2 thought to govern viral entry insingle-cell RNA-sequencing (scRNA-seq) datasets from healthy individualsgenerated by the Human Cell Atlas consortium. We found that ACE2, as well asthe protease TMPRSS2, are differentially expressed in respiratory and gutepithelial cells. In-depth analysis of epithelial cells in the respiratory treereveals that nasal epithelial cells, specifically goblet/secretory cells andciliated cells, display the highest ACE2 expression of all the epithelial cellsanalyzed. The skewed expression of viral receptors/entry-associated proteinstowards the upper airway may be correlated with enhanced transmissivity.Finally, we showed that many of the top genes associated with ACE2 airwayepithelial expression are innate immune-associated, antiviral genes, highlyenriched in the nasal epithelial cells. This association with immune pathwaysmight have clinical implications for the course of infection and viralpathology, and highlights the specific significance of nasal epithelia in viralinfection. Our findings underscore the importance of the availability of theHuman Cell Atlas as a reference dataset. In this instance, analysis of thecompendium of data points to a particularly relevant role for nasal goblet andciliated cells as early viral targets and potential reservoirs of SARS-CoV-2infection. This, in turn, serves as a biological framework for dissecting viraltransmission and developing clinical strategies for prevention and therapy. The 2019 novel coronavirus disease (COVID-19), with a starting point inChina, has spread rapidly among people living in other countries, and isapproaching approximately 34,986,502 cases worldwide according to thestatistics of European Centre for Disease Prevention and Control. There are alimited number of COVID-19 test kits available in hospitals due to theincreasing cases daily. Therefore, it is necessary to implement an automaticdetection system as a quick alternative diagnosis option to prevent COVID-19spreading among people. In this study, five pre-trained convolutional neuralnetwork based models (ResNet50, ResNet101, ResNet152, InceptionV3 andInception-ResNetV2) have been proposed for the detection of coronaviruspneumonia infected patient using chest X-ray radiographs. We have implementedthree different binary classifications with four classes (COVID-19, normal(healthy), viral pneumonia and bacterial pneumonia) by using 5-fold crossvalidation. Considering the performance results obtained, it has seen that thepre-trained ResNet50 model provides the highest classification performance(96.1% accuracy for Dataset-1, 99.5% accuracy for Dataset-2 and 99.7% accuracyfor Dataset-3) among other four used models. COVID-19 is a new type of coronavirus disease which is caused by severe acuterespiratory syndrome coronavirus 2 (SARS-CoV-2). It originated in China in themonth of December 2019 and quickly started to spread within the country. On31st December 2019, it was first reported to country office of World HealthOrganization (WHO) in China. Since then, it has spread to most of the countriesaround the globe. However, there has been a recent rise in trend in believingthat it would go away during summer days, which has not yet been properlyinvestigated. In this paper, relationship of daily number of confirmed cases ofCOVID-19 with three environmental factors, viz. maximum relative humidity(RH_max), maximum temperature (T_max) and highest wind speed (WS_max),considering the incubation period, have been investigated statistically, forfour of the most affected places of China, viz. Beijing, Chongqing, Shanghai,Wuhan and five of the most affected places of Italy, viz. Bergamo, Cremona,Lodi, Milano. It has been found that the relationship with maximum relativehumidity and highest wind is mostly negligible, whereas relationship withmaximum temperature is ranging between negligible to moderate."